package org.example;

public interface Messages {
    String START_MESSAGE = "Привіт, цей бот створений для допомоги педагогам-початківцям." +
            " Якщо хочете отримати допомогу котра пов'язана з комунікацією зі студентами, то натисніть на необхідну кнопку.";

    String TEACHER_SHOULD_BE = "Кожен учень унікальний, і для того, щоб навчання було максимально ефективним, педагог має вміти знаходити підхід до кожного з них. " +
            "Коли викладач знаходить підхід до своїх студентів, він демонструє не лише свою професійну компетентність, а й емоційну зрілість, емпатію та розуміння.\n" +
            "Коли вчитель знаходить підхід до студента, він сприяє його індивідуальному розвитку, підвищує мотивацію до навчання та стимулює інтерес до предмета. " +
            "Це дуже важливо, оскільки допомагає студенту навчитися думати самостійно, вирішувати проблеми та створювати своєрідні підходи до завдань.\n" +
            "Крім того, коли педагог знаходить підхід до студента, він сприяє формуванню позитивного ставлення учня до школи чи університету та загалом до освіти. " +
            "Це може бути ключовим фактором в успіху навчання студента та у його подальшій кар'єрі.";

    String TEACHER_OF_ENGLISH = "Створіть позитивну та відкриту атмосферу у класі. " +
            "Важливо, щоб студенти відчували себе комфортно та безпечно у класі. " +
            "Це дозволить їм більш вільно висловлюватися і ставити питання, що, у свою чергу, сприяє більш ефективному навчанню.\n" +
            "Звертайте увагу на індивідуальні потреби кожного студента. " +
            "Кожен студент навчається по-своєму, і вчителю треба враховувати ці особливості. " +
            "Наприклад, одні студенти можуть бути кращими в читанні, інші - в листі, і т.д. " +
            "Підходьте до кожного студента індивідуально, щоб допомогти їм максимально ефективно навчатись.\n" +
            "Використовуйте різноманітні методи навчання. " +
            "Різноманітність у методах навчання допомагає утримати увагу студентів та зробити навчання цікавішим. " +
            "Використовуйте різні матеріали, наприклад, аудіо та відео записи, ігри та завдання, читання та обговорення текстів тощо.\n" +
            "Намагайтеся створити безперервний потік спілкування англійською у класі. " +
            "Це допомагає студентам покращувати свої комунікативні навички мовою та ефективніше вчитися.\n";
    String TEACHER_OF_PHISICS = "Постарайтеся зробити уроки цікавими та зрозумілими. " +
            "Використовуйте живі приклади, аналогії та завдання з реального життя, щоб студенти краще розуміли, як фізика застосовується у повсякденному житті.\n" +
            "Оцінюйте успіхи студентів не лише за результатами іспитів, а й за прогресом у розумінні матеріалу. " +
            "Намагайтеся виявляти сильні та слабкі сторони кожного студента та допомагати їм працювати над своїми слабкостями.\n" +
            "Надайте своїм студентам багато можливостей для практичної роботи та експериментування. " +
            "Дайте їм можливість самим відкривати та вивчати закони природи та проводити свої власні дослідження.\n" +
            "Постійно вдосконалюйте свій підхід до навчання та стежте за новими технологіями та методиками в освіті. " +
            "Звертайтеся за порадою до колег та беріть участь у професійному спілкуванні.\n" +
            "Пам'ятайте, що кожен студент унікальний і має свої особливості. " +
            "Підходьте до кожного студента з повагою та терпінням і допомагайте їм досягти кращих результатів у навчанні фізики.";
    String TEACHER_OF_MATH = "Використовуйте різноманітні методи навчання. " +
            "Учні мають різні рівні розуміння та навчання, тому урізноманітнюйте свій підхід, використовуючи різні матеріали, методи, техніки та завдання. " +
            "Це допоможе привернути увагу всіх студентів та дати їм можливість навчитися математики.\n" +
            "Звертайте увагу на базові знання. " +
            "Необхідно пам'ятати, що всі студенти мають свій рівень знань та умінь. " +
            "Важливо, щоб вчитель не пропустив жодних базових знань, які студенти можуть не знати чи не розуміти, та надавати їм індивідуальну допомогу у цьому питанні.\n" +
            "Розширюйте кругозір студентів. " +
            "Математика – це більше, ніж просто розв'язання рівнянь. " +
            "Покажіть своїм студентам, що математика є цікавою та корисною наукою. " +
            "Познайомте їх із додатками математики в реальному житті, історією та досягненнями у цій галузі.\n";
    String TEACHER_OF_BIO = "Зробіть матеріал цікавим та доступним: " +
            "Біологія може бути дуже складною та технічної науки, але вчителю слід спробувати представити матеріал таким чином, щоб він був цікавим та доступним для всіх учнів. " +
            "Це може включати використання візуальних засобів, інтерактивних завдань та інших методів, які роблять матеріал цікавішим та зрозумілішим.\n" +
            "Застосуйте практичні завдання: " +
            "Біологія – це наука, яка дуже добре підходить для практичної роботи. " +
            "Використання практичних завдань може допомогти учням краще розуміти матеріал, а також розвивати свої навички та вміння.\n" +
            "Використовуйте сучасні технології: " +
            "Сучасні технології, такі як комп'ютерні програми, інтерактивні навчальні матеріали та онлайн-ресурси, можуть допомогти учням краще розуміти матеріал та бути більш зацікавленими у навчальному процесі.\n" +
            "Заохочуйте питання та дослідження: ";
    String TEACHER_OF_CHEMISTRY = "Намагайтеся зробити уроки цікавими та цікавими. " +
            "Хімія може здатися складною та нудною, але якщо уявити матеріал у формі практичних прикладів, то студенти легше будуть його розуміти.\n" +
            "Давайте студентам можливість брати участь у експериментах. " +
            "Хімічні експерименти можуть бути цікавими та цікавими. " +
            "Надайте їм можливість здійснювати їх самі, а не лише спостерігати.\n" +
            "Звертайте увагу на індивідуальні потреби кожного студента. " +
            "Деякі студенти можуть бути візуальними учнями, а інші - аудіалами. " +
            "Підходьте до кожного студента індивідуально, щоб допомогти їм максимально ефективно навчатись.\n" +
            "Не обмежуйтеся традиційними методами навчання. " +
            "Використовуйте різноманітні методи, такі як ігри, групові проекти, онлайн-ресурси та презентації. " +
            "Це допоможе збільшити інтерес студентів та зробити навчання більш інтерактивним.\n";
    String TEACHER_OF_PHYSYCAL_TRAINING = "Враховуйте індивідуальні особливості кожного студента, такі як вік, рівень фізичної підготовки, наявність травм або хронічних захворювань, а також цілі та мотивацію до занять спортом.\n" +
            "Створюйте індивідуальні програми тренувань, ґрунтуючись на індивідуальних особливостях студента. " +
            "Це може включати зміну інтенсивності тренувань, обсягів і типів вправ, а також періодизацію тренувального процесу.\n" +
            "Слухайте своїх студентів та допомагайте їм знаходити мотивацію до занять спортом. " +
            "Обговоріть з ними цілі та плани, допомагайте їм долати труднощі та стимулюйте їх на шляху до досягнення своїх цілей.\n" +
            "Зверніть увагу на правильну техніку виконання вправ та форму. " +
            "Це допоможе запобігти можливим травмам, покращить результати тренувань і сформує правильні звички.\n" +
            "Урізноманітнюйте тренування, використовуйте різні види фізичної активності, щоб утримати інтерес студентів до занять та допомогти їм знаходити свій улюблений напрямок у спорті.\n" +
            "Не забувайте про позитивний підхід.";

    String TEACHER_TIP = "Вивчіть своїх студентів. " +
            "Кожен учень унікальний і має свої індивідуальні потреби, інтереси та рівень знань. " +
            "Проведіть час на знайомство зі своїми студентами, щоб зрозуміти, як краще викладати їм.\n" +
            "Прагніть створити підтримуюче та безпечне навчальне середовище. " +
            "Студенти повинні відчувати, що ви підтримуєте їх та їх навчання, і що вони можуть звернутися до вас за допомогою або порадою.\n" +
            "Визнайте різноманітність у стилях навчання. " +
            "Учні можуть мати різні стилі навчання, такі як візуальний, аудіальний або кінестетичний. " +
            "Намагайтеся адаптувати свій підхід, щоб увімкнути різні методи навчання, які відповідають потребам кожного учня.\n" +
            "Будьте доступними для спілкування та підтримки. " +
            "Залишайтеся відкритими для зворотного зв'язку від студентів та готовими відповісти на їхні запитання та проблеми. " +
            "Намагайтеся бути доступними як особисто, так і електронною поштою або іншими каналами зв'язку.";
}
